roam/playing_the_zettelkasten_rpg.org
:PROPERTIES:
:ID:       74e003bb-b49a-444e-85e8-25ea22da4027
:END:
#+title: Playing the Zettelkasten RPG
#+date: [2022-07-03 Sun 12:39]
#+filtags: article
- from [[https://zettelkasten.de/posts/playing-zettelkasten-rpg-through-arbitrary-constraints/][Zettelkasten.de]]
- [[id:6a03539f-008a-4f3d-8480-784fb7192702][Zettelkasten principles]]

#+begin_quote
Here it is interesting the taxonomy the author uses to structure it's =zk=.
Could be used by implementing tags for the various layers, which I guess is much more flexible than the method he uses (i.e. prefixes in the titles).
This I already did do intuitivly but this system he created is much more nuanced.
#+end_quote

* Notes
** Rougue-like
- does the =zk= produce writing?
- maybe it's better to think it as a writing partner
- it's tempting to try an compose a piece just by assemblying notes
  + don't overthink or overengineer the =zk=, it's counter productive
- author draws a comparison between the =zk= system and a =rpg= game in the vein of the rougue-likes
  - failing is part of the progression
** Constraints
- they are good to visualize the progress in the =zk=
- break down the ambiguous synthesis of content to small steps
- give way to creativity
- forward momentum
- creating a game
/All these are pretty vague/

- a constrait can limit the amount of choices[fn:pi]
- a notebok in this sense offers natural constraints whereas a wordprocessor doesn't, you can do the hell you want
  - advice: *do not edit while writing*
  - in a digital space we as users have to choose our constraints
** Notes Structure
/the author uses greek letters for identifying the various classes, I think it's probably smarter to have tags for that/

- *base note*
  - a belief
  - a relationship
  - affirming or countering an idea
- *problem note*
  - from 3 related notes
- *series note*
  - frame 3 related problem
- *fragment note*
  - 2 series notes
  - this is where more broad notes are placed
- *concept note*
  - usually linked to *hypothesis* or *thesis*

[fn:pi] [[id:d9f90dc9-be4c-4a2c-9173-cab7c0a53655][Indecision Paralysis]]
