content/posts/playing_the_zettelkasten_rpg.md
+++
title = "Playing the Zettelkasten RPG"
date = 2022-07-03T12:39:00+02:00
draft = false
+++

-   from [Zettelkasten.de](https://zettelkasten.de/posts/playing-zettelkasten-rpg-through-arbitrary-constraints/)
-   [Zettelkasten principles]({{< relref "zettelkasten_principles.md" >}})

> Here it is interesting the taxonomy the author uses to structure it's `zk`.
> Could be used by implementing tags for the various layers, which I guess is much more flexible than the method he uses (i.e. prefixes in the titles).
> This I already did do intuitivly but this system he created is much more nuanced.


## Notes {#notes}


### Rougue-like {#rougue-like}

-   does the `zk` produce writing?
-   maybe it's better to think it as a writing partner
-   it's tempting to try an compose a piece just by assemblying notes
    -   don't overthink or overengineer the `zk`, it's counter productive
-   author draws a comparison between the `zk` system and a `rpg` game in the vein of the rougue-likes
    -   failing is part of the progression


### Constraints {#constraints}

-   they are good to visualize the progress in the `zk`
-   break down the ambiguous synthesis of content to small steps
-   give way to creativity
-   forward momentum
-   creating a game

_All these are pretty vague_

-   a constrait can limit the amount of choices[^fn:1]
-   a notebok in this sense offers natural constraints whereas a wordprocessor doesn't, you can do the hell you want
    -   advice: **do not edit while writing**
    -   in a digital space we as users have to choose our constraints


### Notes Structure {#notes-structure}

_the author uses greek letters for identifying the various classes, I think it's probably smarter to have tags for that_

-   **base note**
    -   a belief
    -   a relationship
    -   affirming or countering an idea
-   **problem note**
    -   from 3 related notes
-   **series note**
    -   frame 3 related problem
-   **fragment note**
    -   2 series notes
    -   this is where more broad notes are placed
-   **concept note**
    -   usually linked to **hypothesis** or **thesis**

[^fn:1]: [Indecision Paralysis]({{< relref "indecision_paralysis.md" >}})
